Q1. List any five functions of the pandas library with execution.

In [111]:
#1. read_csv()
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
#2. head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
#3.tail()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [3]:
#4.describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
#5. loc[:]
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
df1=df[['PassengerId'	,'Survived'	,'Pclass']]
df2=df1.rename(columns={'PassengerId':'A','Survived':'B','Pclass':'C'})

In [3]:
df2

       A  B  C
0      1  0  3
1      2  1  1
2      3  1  3
3      4  1  1
4      5  0  3
..   ... .. ..
886  887  0  2
887  888  1  1
888  889  0  3
889  890  1  1
890  891  0  3

[891 rows x 3 columns]

In [12]:
df3=df2.reindex(index=list(range(1,2000,2)))
df3

         A    B    C
1      2.0  1.0  1.0
3      4.0  1.0  1.0
5      6.0  0.0  3.0
7      8.0  0.0  3.0
9     10.0  1.0  2.0
...    ...  ...  ...
1991   NaN  NaN  NaN
1993   NaN  NaN  NaN
1995   NaN  NaN  NaN
1997   NaN  NaN  NaN
1999   NaN  NaN  NaN

[1000 rows x 3 columns]

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60

In [112]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
sum=0
for i in df['PassengerId'][0:3]:
    sum+=i
sum

6

In [114]:
def func_sum(l):
    sum=0
    for i in l:
        sum+=i
    return sum
func_sum(df['PassengerId'][0:3])

6

In [117]:
df['PassengerId'].rolling(window=3).sum()[2]

6.0

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
data={'Text':['i love you', 'my company name is tcs', 'i am from kadapa']}
df3=pd.DataFrame(data)
df3

                     Text
0              i love you
1  my company name is tcs
2        i am from kadapa

In [30]:
df3["word_knt"]=df3["Text"].apply(lambda x: len(x.split()))

In [31]:
df3

                     Text  word_knt
0              i love you         3
1  my company name is tcs         5
2        i am from kadapa         4

In [84]:
df3['Text'].str.split()

0                  [i, love, you]
1    [my, company, name, is, tcs]
2           [i, am, from, kadapa]
Name: Text, dtype: object

In [85]:
df3['Text'].str.split().str.len()

0    3
1    5
2    4
Name: Text, dtype: int64

In [86]:
df3['Word_Count'] = df3['Text'].str.split().str.len()

In [87]:
df3

                     Text  Word_Count
0              i love you           3
1  my company name is tcs           5
2        i am from kadapa           4

In [90]:
df3['Text'].tolist()

['i love you', 'my company name is tcs', 'i am from kadapa']

In [88]:
df3['totalwords'] = [len(x.split()) for x in df3['Text'].tolist()]

In [89]:
df3

                     Text  Word_Count  totalwords
0              i love you           3           3
1  my company name is tcs           5           5
2        i am from kadapa           4           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [92]:
df3.size
#Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

9

In [95]:
df3.shape
#Returns tuple of shape (Rows, columns) of dataframe/series

(3, 3)

Q6. Which function of pandas do we use to read an excel file?

In [51]:
#pd.read_excel()

7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [33]:
data={'mail':['malluvenkat@gmail.com','saipranav@yahoo.com']}

In [34]:
df=pd.DataFrame(data)
df

                    mail
0  malluvenkat@gmail.com
1    saipranav@yahoo.com

In [35]:
df['userId']=df['mail'].str.split('@')[0]

In [36]:
df

                    mail       userId
0  malluvenkat@gmail.com  malluvenkat
1    saipranav@yahoo.com    gmail.com

In [41]:
df['id']=df['mail'].apply(lambda x: x.split('@')[0])
df

                    mail       userId           id
0  malluvenkat@gmail.com  malluvenkat  malluvenkat
1    saipranav@yahoo.com    gmail.com    saipranav

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.

In [42]:
data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}

In [43]:
df=pd.DataFrame(data)

In [44]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [45]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column

In [55]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [56]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [57]:
df1=df[['Age']]

In [59]:
df2=df1.rename(columns={'Age':'Values'})

In [60]:
df2['Values'].mean()

29.69911764705882

In [64]:
df2['Values'].median()

28.0

In [65]:
df2['Values'].std()

14.526497332334044

In [66]:
df2['Values'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Values, dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.

In [67]:
import pandas as pd
data={'Sales':[56,64,32,89,43,25,11,66,78,99],'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10']}

In [68]:
df=pd.DataFrame(data)

In [69]:
df

   Sales        Date
0     56  2023-01-01
1     64  2023-01-02
2     32  2023-01-03
3     89  2023-01-04
4     43  2023-01-05
5     25  2023-01-06
6     11  2023-01-07
7     66  2023-01-08
8     78  2023-01-09
9     99  2023-01-10

In [70]:
df['Average']=df['Sales'].rolling(window=7).mean()

In [71]:
df

   Sales        Date    Average
0     56  2023-01-01        NaN
1     64  2023-01-02        NaN
2     32  2023-01-03        NaN
3     89  2023-01-04        NaN
4     43  2023-01-05        NaN
5     25  2023-01-06        NaN
6     11  2023-01-07  45.714286
7     66  2023-01-08  47.142857
8     78  2023-01-09  49.142857
9     99  2023-01-10  58.714286

In [72]:
l=[]
a=[]
for i in df['Sales']:
    l.append(i)
#    print(l)
#    print(l.mean())
    sum=0
    if len(l)>7:
        k=l[-1:-8:-1]
    else:
        k=l
    for j in k:
        sum+=j
        avg=sum/(len(k))
    a.append(avg)
#    print(a)
a

[56.0,
 60.0,
 50.666666666666664,
 60.25,
 56.8,
 51.5,
 45.714285714285715,
 47.142857142857146,
 49.142857142857146,
 58.714285714285715]

In [73]:
df['MovAvg']=a

In [74]:
df

   Sales        Date    Average     MovAvg
0     56  2023-01-01        NaN  56.000000
1     64  2023-01-02        NaN  60.000000
2     32  2023-01-03        NaN  50.666667
3     89  2023-01-04        NaN  60.250000
4     43  2023-01-05        NaN  56.800000
5     25  2023-01-06        NaN  51.500000
6     11  2023-01-07  45.714286  45.714286
7     66  2023-01-08  47.142857  47.142857
8     78  2023-01-09  49.142857  49.142857
9     99  2023-01-10  58.714286  58.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [84]:
import datetime
import calendar
data={'date':['1 1 2016', '1 1 2017', '1 1 2018','1 1 2019','1 1 2020','1 1 2021','1 1 2022','1 1 2023']}

In [85]:
df=pd.DataFrame(data)

In [86]:
df

       date
0  1 1 2016
1  1 1 2017
2  1 1 2018
3  1 1 2019
4  1 1 2020
5  1 1 2021
6  1 1 2022
7  1 1 2023

In [87]:
list(df['date'][0:])

['1 1 2016',
 '1 1 2017',
 '1 1 2018',
 '1 1 2019',
 '1 1 2020',
 '1 1 2021',
 '1 1 2022',
 '1 1 2023']

In [91]:
l=[]
for i in list(df['date'][0:]):
        born = datetime.datetime.strptime(i, '%d %m %Y').weekday()
#        l.append(born)
        l.append((calendar.day_name[born]))
print(l)

['Friday', 'Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Friday', 'Saturday', 'Sunday']

In [92]:
df['weekday']=l

In [93]:
df

       date    weekday
0  1 1 2016     Friday
1  1 1 2017     Sunday
2  1 1 2018     Monday
3  1 1 2019    Tuesday
4  1 1 2020  Wednesday
5  1 1 2021     Friday
6  1 1 2022   Saturday
7  1 1 2023     Sunday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [104]:
data=pd.date_range(start = '2021-01-01' ,end = '2023-12-01')

In [105]:
df=pd.DataFrame({'date': data})

In [106]:
df

           date
0    2021-01-01
1    2021-01-02
2    2021-01-03
3    2021-01-04
4    2021-01-05
...         ...
1060 2023-11-27
1061 2023-11-28
1062 2023-11-29
1063 2023-11-30
1064 2023-12-01

[1065 rows x 1 columns]

In [109]:
df[(df['date']>'2023-03-01') & (df['date']<'2023-03-31') ]

          date
790 2023-03-02
791 2023-03-03
792 2023-03-04
793 2023-03-05
794 2023-03-06
795 2023-03-07
796 2023-03-08
797 2023-03-09
798 2023-03-10
799 2023-03-11
800 2023-03-12
801 2023-03-13
802 2023-03-14
803 2023-03-15
804 2023-03-16
805 2023-03-17
806 2023-03-18
807 2023-03-19
808 2023-03-20
809 2023-03-21
810 2023-03-22
811 2023-03-23
812 2023-03-24
813 2023-03-25
814 2023-03-26
815 2023-03-27
816 2023-03-28
817 2023-03-29
818 2023-03-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported?

In [96]:
import pandas as pd